[

  {
    "q": "Quels cours se donneront en présence au cégep?",
    "r": "En fonction de l'évolution de la situation de la covid, certains cours pourraient avoir une partie en présence. Pour l'instant, l'ensemble des cours se donnent à distance.",
    "cats": ["covid"],
    "liens": []
  },

  {
    "q": "Qu'est-ce que je dois installer sur mon ordi pour les cours?",
    "r": "Dans chaque cours, les profs vont te montrer comment installer les logiciels nécessaires. Tu peux aussi visiter la page sur les logiciels gratuits.",
    "cats": ["logiciels"],
    "liens": ["goodies"]
  },



  {
    "q": "À quoi ressemble les labos?",
    "r": "Nous avons des laboratoires de 24 postes où se donnent tous les cours. Même s'il y a de la théorie, tu as un poste pour mettre en pratique tout de suite ce que tu as appris. En ce moment avec la covid, nos labos sont vides, tout le monde travaille de chez lui.",
    "cats": ["locaux", "covid"],
    "liens": []
  },

  {
    "q": "C'est quoi un cours hybride?",
    "r": "Un cours hybride mélange des activités en présence au collège et des activités à distance. Comme personne ne sait vraiment comment la situation va évoluer la plupart des cours sont indiqués comme hybride.",
    "cats": ["covid", "hybride"],
    "liens": []
  },

  {
    "q": "Est-ce que je dois acheter un portable?",
    "r": "Un ordi portable te permet de garder le même environnement de travail que tu travailles au CEGEP ou à la maison. Toutefois dans le contexte actuel, tous les cours sont à la maison. Si ton ordinateur ne suffit pas pour les cours, nous te donnerons accès à distance à une machine du département.",
    "cats": ["covid", "ordi"],
    "liens": []
  },

  {
    "q": "Pourquoi je dois acheter un ordi?",
    "r": "D'habitude, tu travailles au collège sur un ordi du collège. La plupart des étudiants continuent leurs travaux à la maison mais ce n'est pas une obligation. Avec la Covid, nous enseignons à distance, il est devenu nécessaire pour tous les étudiants d'avoir un ordi et une bonne connexion Internet à la maison.",
    "cats": ["covid", "ordi"],
    "liens": []
  },

  {
    "q": "Quelles spécifications pour acheter un ordi pour la technique?",
    "r": "Au début de la technique, les cours sont moins demandant pour ton ordi. Par contre, si tu achètes un ordi qui doit aller jusqu'à la fin de tes études, nous recommandons d'acheter un processeur Intel i5 ou Ryzen 3600 ou supérieur. Au niveau stockage, on te recommande 512 Go en SSD, tu peux t'en sortir avec 256Go en programmation mais pour réseau 512 ou même 1To. Côté mémoire vive, si tu vas en réseau ça prend 16Go, en programmation tu peux sans doute y arriver avec 8Go mais c'est moins confortable. Côté logiciel, tu verras qu'on fournit tout. Si côté argent, c'est difficile, contacte-nous et on t'indiquera des ressources. ",
    "cat": ["covid", "ordi"],
    "liens": ["http://guidelongueuil.cegepmontpetit.ca/aide-financiere-covid-19/"]
  },

  {
    "q": "Quelle formation si je veux faire de l'intelligence artificielle?",
    "r": "La formation habituelle pour l'IA, c'est l'université en informatique, à l'université de Montréal par exemple. Au CEGEP, nous avons le pré-universitaire et les techniques. PréU, ça prend 2 ans et tu peux continuer au bac en info, la technique prend 3 ans et tu peux aussi continuer au bac (avec des cours crédités). La grosse différence, dans la technique tu vas faire dans les 1000 heures de cours de programmation, au préU, une centaine et le reste dans d'autres matières.",
    "cats": ["IA", "professions"],
    "liens": ["https://www.umontreal.ca/intelligenceartificielle/"]
  },
  {
    "q": "Quelle formation si je veux faire du jeu video?",
    "r": "La formation habituelle des pros du jeu video, c'est le Bac en informatique, si possible accompagné de projets de jeux que tu as fait par toi-même. Au CEGEP, nous avons le pré-universitaire et les techniques. PréU, ça prend 2 ans et tu peux continuer au bac en info, la technique prend 3 ans et tu peux aussi continuer au bac (avec des cours crédités). La grosse différence, dans la technique vas faire dans les 1000 heures de cours de programmation, au préU, une centaine et le reste dans d'autres matières.",
    "cats": ["jeux video", "professions"],
    "liens": []
  },

  {
    "q": "Ça veut dire quoi copier ou plagier en info?",
    "r": "Quand on écrit du code ou qu'on monte des serveurs ou des réseaux, on peut se demander ce qu'on a le droit d'échanger avec les autres étudiants ou pas. Pour ça on a fait une page, suis le lien",
    "cats": ["plagiat", "travaux"],
    "liens": ["/plagiat"]
  },

  {
    "q": "Les travaux c'est seul ou en équipe?",
    "r": "Ça dépend des cours. On retrouve les travaux d'équipe plutôt à la fin de la formation. Le projet des finissant se fait intégralement en équipe. Dans tous les cas, chaque prof explique tout ça au premier cours.",
    "cats": ["équipe", "travaux"],
    "liens": []
  },

  {
    "q": "Est-ce que je peux travailler pendant mes études?",
    "r": "Ta présence et ton implication sont nécessaires pour tes cours. C'est impossible d'avoir un emploi à temps et suivre la formation. Par contre, de nombreux étudiants ont un emploi à temps partiel. Tu peux également commencer à travailler en info pendant ta formation, plusieurs ont déjà un emploi en 3ème année (à temps partiel).",
    "cats": ["professions", "travail"],
    "liens": []
  }
]
